
function init_config() {
    let res = {};
    res.data = {
        "data": {
            "site_name": "芒点智慧外链系统",
            "site_logo": "https:\/\/wl.hnmangdian.com\/console\/upload\/bb6f2c8d211cacb7ca3a315c6ad3b4de_5585.png",
            "login_page_logo": "https:\/\/wl.hnmangdian.com\/console\/upload\/1a30804f0ba63955ccefb2d6470b33f4_6610.png",
            "site_beian": "",
            "site_gabeian": "",
            "site_domain": "https:\/\/wl.hnmangdian.com",
            "weixin_kefu": "https:\/\/wl.hnmangdian.com\/console\/upload\/2563c849b54e3e4d62e2edc55532f205_2289.png",
            "notice1": "应公安部要求，我们将对生成内容进行检测，如发现违法违规(包括但不限于诈骗、色情、博彩等)，则立即封禁账号且不予退款。",
            "notice2": "芒点智慧外链系统支持从抖音、快手、知乎、浏览器等跳转到个人微信、微信群，小程序、公众号、QQ\/群，超强私域引流工具，推广营销必备！",
            "notice3": "对系统如有疑问可联系客服微信：mdwlqc",
            "notice4": "",
            "notice5": "",
            "notice6": "",
            "notice7": "",
            "notice8": "",
            "notice9": "",
            "notice10": "",
            "xieyi": "<p style=\"text-align: center;\"><span style=\"font-size: 29px;\"><strong>用户服务协议<\/strong><\/span><\/p><p style=\"text-align: left;\">欢迎使用芒点智慧引流系统：<\/p><p style=\"text-align: left;\">芒点智慧引流系统是海南芒点网络科技有限公司（下称“芒点科技”）提供的互联网软件服务。本服务条款（下称“服务条款”）是您与芒点科技之间关于您（“您”或“用户”）访问和使用本网站以及芒点科技提供的其他服务（下称“服务”）的主要协议。<\/p><p style=\"text-align: left;\">在接受本协议之前，请您仔细阅读全部内容，如您无法准确理解或不同意本协议的任一内容，请不要进行后续操作。您通过网络页面点击确认、实际购买或使用芒点科技所提供的服务等操作均表示您已阅读并充分理解本协议之内容，与芒点科技就使用或订购相应产品和\/或服务已达成合意，并同意接受本协议的全部约定内容，受其约束。<\/p><p style=\"text-align: left;\">由于互联网行业高速发展，本服务条款并不能完整罗列并覆盖您与<span style=\"font-family: 宋体;\">芒点科技<\/span>的所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，您同意芒点科技有权不时地对本服务条款做任何修改和补充，并予以公示。通常情况下（例如当需要进行修改或补充以满足适用法律要求时），对服务条款、隐私政策或规则的修改将在公布时或规定的生效日立即生效。您继续访问和使用本网站即视为您接受修订后的服务条款。否则，您有权通过停止访问本网站且拒绝使用服务、删除您在本网站上的信息和帐户等方式来终止服务条款。<\/p><p style=\"text-align: left;\">如果您代表某个机构而非您个人注册、登录和使用本网站和\/或我们其他的服务，则您将被认为获得充分授权代表该机构同意本服务条款以及服务条款不时的修改和补充。<\/p><h3 style=\"text-align: left;\"><strong>一、知识产权<\/strong><\/h3><p style=\"text-align: left;\">芒点科技完全拥有本网站产品及服务（包括对其进行的任何开发和升级）的所有权及所有相关的知识产权（包括但不限于源代码、目标代码、文档资料、界面设计、版面框架、以及任何由芒点科技根据维护与技术支持提供的软件、资料等）。您认同芒点科技拥有的所有权及知识产权，并承诺尊重及不以任何方式侵害<span style=\"font-family: 宋体;\">芒点科技<\/span>的所有权及知识产权。未经芒点科技书面许可，您不得复制、传播、转让、许可或提供他人使用上述知识成果，否则应承担相应的责任，且本网站有权终止您对本网站的使用且不退还任何费用。<\/p><p style=\"text-align: left;\">用户在本网站平台所创建的独创性数据归属该用户所有，该用户有权对前述数据进行任何形式的处置，包括从平台中复制，导出和删除。<\/p><p style=\"text-align: left;\">用户应当确保其公开或存储（方式包括但不限于：上传、保存、公布、发布等）于本网站及相关服务器的内容不存在任何侵犯其他第三方知识产权的情形。若存在本条所述情形，芒点科技有权根据具体情节针对上述内容，采取包括但不限于限制、屏蔽、删除、修改等手段，由此给网站用户造成的损失由网站用户自行承担；若<span style=\"font-family: 宋体;\">芒点科技<\/span>因网站用户存在本条所述行为而向其他第三方承担法律责任的，芒点科技有权向网站用户追偿全部损失。<\/p><h3 style=\"text-align: left;\"><strong>二、注册账号<\/strong><\/h3><p style=\"text-align: left;\">为了能访问本网站和使用服务，您同意以下事项：依本网站注册提示填写准确的、真实的注册手机号、密码和名称，并确保今后更新的登录手机号、名称、头像等资料的有效性和合法性。若您提供任何违法、虚假、不道德或芒点科技认为不适合在本网站上展示的资料，或者芒点科技有理由怀疑您的资料属于病毒程序或恶意操作，或者您违反本服务条款的规定，或者您未经芒点科技同意将本网站用于商业目的，芒点科技有权暂停或终止您的帐号，并拒绝您于现在和未来使用服务之全部或任何部分。<\/p><p style=\"text-align: left;\">尽管有前述规定，<span style=\"font-family: 宋体;\">芒点科技<\/span>无义务对任何用户的任何登记资料承担任何责任，包括但不限于鉴别、核实任何登记资料的真实性、准确性、完整性、适用性及\/或是否为最新资料的责任。<\/p><p style=\"text-align: left;\">同时，芒点科技建议您妥善保管您的手机号、密码和名称，准确输入该等信息将作为您访问登录本网站并享有服务的关键环节。如果您发现有人未经授权使用您的帐户信息或怀疑任何人未经授权可能能够访问您的私有内容，您应立即更改密码，并向我们反馈。<\/p><h3 style=\"text-align: left;\"><strong>三、网站使用规则<\/strong><\/h3><p style=\"text-align: left;\">用户在使用本网站服务过程中，必须遵循以下规则：<\/p><p style=\"text-align: left;\">遵守中国有关的法律法规； 不得对本网站服务进行任何形式的对其他第三方的再授权使用、销售或转让； 不得为设计开发竞争产品对本网站进行任何形式的反向工程、反向编译、反汇编，或在竞争产品抄袭模仿本网站的设计； 不得对本网站的连续服务和商誉构成损害的其他行为，包括对网站服务器的攻击； 遵守本协议中的全部约定。 如用户在使用本网站服务时违反任何上述规定，芒点科技有权要求用户改正或直接采取一切必要的措施（包括但不限于暂停或终止用户使用本网站服务的权利并追讨因此带来的损失）以减轻用户不当行为造成的影响。<\/p><p style=\"text-align: left;\">用户须对在本网站的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；不得恶意使用注册帐户导致其他用户误认；否则本网站有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任。<\/p><p style=\"text-align: left;\">用户直接或通过各类方式（如 RSS 源和站外 API 引用等）间接使用本网站服务和数据的行为，都将被视作已无条件接受本协议全部内容；若用户对本协议的任何条款存在异议，请停止使用本网站所提供的全部服务。<\/p><p style=\"text-align: left;\">用户承诺不得以任何方式利用本网站直接或间接从事违反中国法律、以及社会公德的行为， 本网站有权对违反上述承诺的内容予以删除，针对违反法律法规的行为，本网站将上报用户数据至相关执法部门。<\/p><p style=\"text-align: left;\">用户不得利用本网站服务制作、上载、复制、发布、传播或者转载如下内容：<\/p><p style=\"text-align: left;\">危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； 损害国家荣誉和利益的； 煽动民族仇恨、民族歧视，破坏民族团结的； 破坏国家宗教政策，宣扬邪教和封建迷信的； 散布谣言，扰乱社会秩序，破坏社会稳定的； 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； 侮辱或者诽谤他人，侵害他人合法权益的； 含有法律、行政法规禁止的其他内容的信息。 本网站有权对用户使用本网站的情况进行审查和监督，如用户在使用本网站时违反任何上述规定， 本网站或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容、暂停或终止用户使用本网站的权利）以减轻用户不当行为造成的影响。<\/p><p style=\"text-align: left;\">本网站有权但无义务对用户发布的内容进行审核，有权根据相关证据结合《侵权责任法》、《信息网络传播权保护条例》等法律法规对侵权信息进行处理。<\/p><h3 style=\"text-align: left;\"><strong>四、用户信息保护<\/strong><\/h3><p style=\"text-align: left;\">本网站将尽可能采取一切措施保护用户数据及个人信息资料安全，只根据用户在网站上的行为指示来分发用户的信息，不会向任何第三方公开或共享用户的具体数据，除非有下列情况：<\/p><p style=\"text-align: left;\">有关法律、法规规定； 在紧急情况下，为维护用户及公众的权益； 为维护<span style=\"font-family: 宋体;\">芒点科技<\/span>的商标权、专利权及其他任何合法权益； 其他依法需要公开、编辑或透露个人信息的情况。 本网站保留使用汇总统计性信息的权利，在不透露单个用户隐私资料的前提下，本网站有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。<\/p><h3 style=\"text-align: left;\"><strong>五、免责申明<\/strong><\/h3><p style=\"text-align: left;\">本网站将尽最大努力保障软件平台的连续可靠运行，但鉴于网络服务的特殊性，本网站对可能发生的服务的中断或终止所可能导致的一切损失，<strong>不承担任何法律责任及经济赔偿<\/strong>。<\/p><p style=\"text-align: left;\">本网站将尽最大努力保障客户数据的安全备份，但无法承诺100%的数据恢复，对因数据丢失带来的任何直接或间接损失不承担任何责任。<\/p><p style=\"text-align: left;\">在发生需要从备份文件中恢复数据的情形时，本网站通常需要2小时，最长72小时完成，在此时间范围内的数据恢复视作服务是连续的。<\/p><p style=\"text-align: left;\">对于因不可抗力或本网站不能控制的原因造成的网络服务中断和长时间终止，本网站不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。<\/p><p style=\"text-align: left;\">本网站将尽可能采取一切措施保护用户数据及个人信息资料安全。但用户通过使用或安装第三方应用打开本网站中的文件，该文件会在第三方应用中打开，由于第三方应用而造成的损失，本网站不承担任何法律责任及经济赔偿。<\/p><p style=\"text-align: left;\">鉴于互联网体制及环境的特殊性，客户在服务中分享的信息及个人资料有可能会被他人复制、转载、擅改或做其它非法用途，本网站对此不承担任何责任。<\/p><p style=\"text-align: left;\">客户在使用服务过程中可能存在来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）及匿名或冒名的信息的风险本网站对此不承担任何责任。<\/p><p style=\"text-align: left;\">与特定网络安全事故相关免责事由。例如，在法律允许的范围内，本网站对于因受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏而导致的服务中断及信息泄露不承担责任。<\/p><h3 style=\"text-align: left;\"><strong>六、服务变更\/中断\/终止<\/strong><\/h3><p style=\"text-align: left;\">如因系统维护或升级的需要而暂停网络服务、调整服务功能的，<span style=\"font-family: 宋体;\">芒点科技<\/span>将尽可能事先在网站上进行通告。<\/p><p style=\"text-align: left;\">如发生下列任何一种情形，芒点科技有权单方面中断或终止向用户提供服务而无需事先通知用户：<\/p><p style=\"text-align: left;\">用户提供的个人资料不真实，或违反其他用户个人资料提供规则的； 用户违反法律法规、本服务条款或相关服务规则规定的。 您理解并认可，为技术升级、服务体系升级、或因经营策略调整或配合国家重大技术、法规政策等变化，<span style=\"font-family: 宋体;\">芒点科技<\/span>不保证永久的提供某种服务，或可能变更所提供服务的形式、规格或其他方面，在终止该种服务或进行此种变更前，芒点科技将尽最大努力且提前以网站公告、站内信、邮件或短信等一种或多种方式进行事先通知；如终止提供该种服务的，芒点科技将尽合理的努力给您预留合理的时间，妥善处理后续事宜。<\/p><h3 style=\"text-align: left;\"><strong>七、合约变更<\/strong><\/h3><p style=\"text-align: left;\">本网站有权随时对本合约的条款进行修订，一旦本合约的内容发生变更，本网站将会在修订生效日前一个工作日更新。<\/p><p style=\"text-align: left;\">如用户继续使用网络服务，则视为用户接受本网站对合约相关条款所做的修订。<\/p><h3 style=\"text-align: left;\"><strong>八、违约责任<\/strong><\/h3><p style=\"text-align: left;\">由于用户通过服务上载、传送或分享之信息、使用本服务其他功能、违反本合约、或侵害他人任何权利因而衍生或导致任何第三人向本网站及其关联公司提出任何索赔或请求，或本网站及其关联公司因此而发生任何损失，用户同意将足额进行赔偿（包括但不限于合理的律师费）。<\/p><h3 style=\"text-align: left;\"><strong>九、法律适用<\/strong><\/h3><p style=\"text-align: left;\">本合约的订立、执行和解释以及争议的解决均应适用中华人民共和国法律并受中国法院管辖。<\/p><p style=\"text-align: left;\">协议双方就本合约内容或其执行发生任何争议，应首先力争友好协商解决；协商不成时，任何一方均可向<span style=\"font-family: 宋体;\">芒点科技<\/span>注册地所在的人民法院提起诉讼。<\/p>",
            "client_secret": "b6a278dddc1d7a06032f56f2155c84e3",
            "client_key": "aw7r184vmttw7z4m",
            "merchantId": "1636874649",
            "appid": "wx20a3758819f3443d",
            "mchSerial": "191007ABFE09E16F05A3A3E418D3B8EE583E56F0",
            "apiv3Key": "db248eff0746aa2f5188fe9d2185f7ca",
            "apiclient_key": "file:\/\/\/www\/wwwroot\/wl.hnmangdian.com\/console\/public\/upload\/apiclient_key.pem",
            "platform_key": "file:\/\/\/www\/wwwroot\/wl.hnmangdian.com\/console\/public\/upload\/apiclient_cert.pem",
            "app_id": "253775",
            "secret": "gXfUomJAFH6JKYEavH9ewdXPAfMKauYD",
            "jifen": "1",
            "longpress": "1",
            "longpresstime": "5",
            "zhitiaojifen": "2",
            "ominapp_max": "9999",
            "ominapp_jifen": "0"
        },
        "code": 200,
        "msg": "获取成功"
    };
    if (location.href.indexOf('console') != -1) {//后台
        $('title').text(res.data.site_name);
    }
    $('#app .menu-box .logo').css('background-image', `url(${res.data.site_logo})`);
    $('#login_page_logo').attr('src', res.data.login_page_logo);
    // $.ajax({
    //     type: "POST",
    //     url: "../../console/public/system_config.php",
    //     success: function (res) {
    //         if (res.code == 200) {
    //             if (location.href.indexOf('console') != -1) {//后台
    //                 $('title').text(res.data.site_name);
    //             }
    //             $('#app .menu-box .logo').css('background-image', `url(${res.data.site_logo})`);
    //             $('#login_page_logo').attr('src', res.data.login_page_logo);
    //         }
    //     },
    //     error: function () {

    //     }
    // });
}

$(function () {
    init_config();
})